Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: Installing via scoop will do this for you.
zh_cn: 通过scoop安装将为你做到这一点。

source: Instance profile credentials delivered through the Amazon EC2 metadata service
zh_cn: 通过 Amazon EC2 元数据服务交付的实例配置文件凭证

source: Instead of overriding the value, we just want to ensure that the greet method on our `GreetingService` was called by this test.
zh_cn: 我们没有覆盖这个值，而只是想确保我们的 `GreetingService` 上的greet方法被这个测试所调用。

source: Instead of returning a payload, you can return a `io.smallrye.reactive.messaging.kafka.Record` to send key/value pairs:
zh_cn: 为了发送键/值对， 您可以直接返回一个 `io.smallrye.reactive.messaging.kafka.Record` 来代理一个payload：

source: Instruct Panache to run the given (asynchronous) action in a transaction. The transaction completes when the action completes.
zh_cn: 该指令使Panache在一个事务中运行给定的(异步)操作。当该操作完成时，事务会结束。

source: Instructs the prices channel to be managed by the AMQP connector
zh_cn: 指示将由AMQP连接器管理的价格通道。

source: Integrating with Kafka - Common patterns
zh_cn: 与Kafka的整合--通用模式

source: Integration
zh_cn: 集成

source: IntelliJ IDEA JUnit template
zh_cn: IntelliJ IDEA JUnit模板

source: IntelliJ IDEA plugin that works in IntelliJ IDEA Community and Ultimate. Available from Marketplace.
zh_cn: IntelliJ IDEA插件，可用于IntelliJ IDEA Community/Ultimate。在插件市场安装。

source: Interacting with the application
zh_cn: 与应用程序进行交互

source: Introduction
zh_cn: 简介

source: Introduction to writing REST JSON Services
zh_cn: 编写REST JSON服务的介绍

source: Introspection
zh_cn: 自查

source: Invoke the Lambda
zh_cn: 调用Lambda

source: Issues
zh_cn: 缺陷

source: Issues using GraalVM with macOS Catalina
zh_cn: 在MacOS Catalina上使用GraalVM的问题

source: Issues with packaging on Windows
zh_cn: 在Windows上打包的问题

source: It allows more advanced reactive use cases, for example, you can use it to send server-sent events (SSE) via RESTEasy Reactive:
zh_cn: 它允许更高级的响应式用例，例如，你可以用它来通过RESTEasy Reactive发送服务器发送的事件（SSE）：

source: It also enables producer idempotence support.
zh_cn: 这同样会启用生产者幂等性支持。

source: It attempts to identify archives with Panache entities (and consumers of Panache entities) by the presence of the marker file `META-INF/panache-archive.marker`. Panache includes an annotation processor that will automatically create this file in archives that depend on Panache (even indirectly). If you have disabled annotation processors you may need to create this file manually in some cases.
zh_cn: Panache通过判断是否存在标记文件 `META-INF/panache-archive.marker` 来识别jar包是否包含 Panache 实体类（及 Panache 实体类的调用方）。Panache 包含一个注解处理器，它会自动在依赖 Panache（包括间接依赖Panache）的jar包中创建此文件。如果在某些情况下你禁用了注解处理器，可能需要手动创建此文件。

source: It attempts to identity archives with Panache entities (and consumers of Panache entities) by the presence of the marker file `META-INF/panache-archive.marker`. Panache includes an annotation processor that will automatically create this file in archives that depend on Panache (even indirectly). If you have disabled annotation processors you may need to create this file manually in some cases.
zh_cn: 它试图通过标记文件 `META-INFpanache-archive.marker` 的存在来识别具有 Panache 实体（和 Panache 实体的消费者）的档案。 Panache 包含一个注释处理器，它将自动在依赖于 Panache（甚至间接）的档案中创建此文件。如果您禁用了注释处理器，在某些情况下您可能需要手动创建此文件。

source: It can be activated and configured as follows:
zh_cn: 它可以按以下方式激活和配置:

source: It can be useful to test the application without having to start a Kafka broker. To achieve this, you can _switch_ the channels managed by the Kafka connector to _in-memory_.
zh_cn: 在不启动Kafka broker的情况下测试应用程序会很有用。为了实现这一点，您可以把Kafka连接器管理的 channels _切换_ 到_内存 _中 。

source: It explains why the endpoint has no `@RolesAllowed` annotations - the resource access permissions are set directly in Keycloak.
zh_cn: 这解释了为什么节点没有 `@RolesAllowed` 注解--资源访问权限是直接在Keycloak中设置的。

source: It generates the following in `./getting-started`:
zh_cn: 它在 `./getting-started` 中产生了以下内容：

source: It instructs the application to use PostgreSQL for the database and to handle the database schema generation.
zh_cn: 它指示应用程序使用PostgreSQL数据库，并处理数据库模式的生成。

source: It is also possible to block on sending the event to the emitter with the `sendAndAwait` method. It will only return from the method when the event is acked or nacked by the receiver.
zh_cn: 也可以通过 `sendAndAwait` 方法在发送事件到emitter的时候进行阻塞。只有当事件被接收者确认或拒绝时，它才会从该方法中返回。

source: It is also possible to define role based policies, as shown in the example. These policies will only allow users with the specified roles to access the resources.
zh_cn: 也可以定义基于角色的策略，如例子所示。这些策略将只允许具有指定角色的用户访问资源。

source: It is also possible to directly inject the URL into the test which can make is easy to use a different client. This is done via the `@TestHTTPResource` annotation.
zh_cn: 也可以直接将URL注入测试中，从而可以更容易的使用不同的客户端。可通过 `@TestHTTPResource` 注解完成。

source: It is also possible to generate a public and private key pair using the OpenSSL command line tool.
zh_cn: 也可以使用OpenSSL命令行工具生成一个公钥和私钥对。

source: It is also possible to re-run the tests against a native executable that has already been built. To do this run `./mvnw test-compile failsafe:integration-test -Pnative`. This will discover the existing native image and run the tests against it using failsafe.
zh_cn: 也可以针对已经构建的原生可执行文件重新运行测试。要做到这一点，运行 `./mvnw test-compile failsafe:integration-test` 。这将查找现有的原生可执行文件，并使用failsafe插件对其运行测试。

source: It is also possible to re-run the tests against a native executable that has already been built. To do this run `./mvnw test-compile failsafe:integration-test`. This will discover the existing native image and run the tests against it using failsafe.
zh_cn: 也可以针对已经建立的原生可执行文件重新运行测试。要做到这一点，运行 `./mvnw test-compile failsafe:integration-test` 。这将发现现有的原生镜像，并使用故障安全系统对其运行测试。

source: It is also possible to test native executables using `@QuarkusIntegrationTest`. This supports all the features mentioned in this guide except injecting into tests (and the native executable runs in a separate non-JVM process this is not really possible).
zh_cn: 您也可以使用 `@QuarkusIntegrationTest` 来测试本地可执行文件。除了注入测试（本地可执行文件在一个单独的非JVM进程中运行，所以它实际上是不可能做到的）以外，该特性支持本指南中提到的所有功能。

source: It is built on top of the xref:mongodb.adoc[MongoDB Client] extension.
zh_cn: 它是建立在 link:mongodb.html[MongoDB客户端] 扩展之上的。

source: It is important that the alternative be present in the `src/test/java` directory rather than `src/main/java`, as otherwise it will take effect all the time, not just when testing.
zh_cn: 注意，alternative要放置于 `src/test/java` 目录中而不是 `src/main/java` ，否则它将不仅仅只是在测试时生效。

source: It is important to note that gauges are sampled rather than set; there is no record of how the value associated with a gauge might have changed between measurements. In this example, the size of the list is observed when the Prometheus endpoint is visited.
zh_cn: 需要注意的是，gauges是采样的，而不是设置的；因而与一个gauge相关的值在不同的测量之间可能会发生怎样的变化将无从记录。在本例中，列表的大小会在访问Prometheus节点时被观察到。

source: It is not possible for Quarkus to determine at build time the type included in the `Response` as the information is not available. In this case, Quarkus won't be able to automatically register for reflection the required classes.
zh_cn: Quarkus不可能在构建时确定 `Response` 中包含的类型，因为该信息不可用。在这种情况下，Quarkus将无法自动注册反映所需的类。

source: It is possible to add a tag that would convey a little more information, however. Let's adjust our code, and move the counter to add some tags to convey additional information.
zh_cn: 不过添加一个标签以传达更多的信息也是有可能的。让我们调整我们的代码，改动一下counter来添加一些标签以传达更多信息。

source: It is possible to configure multiple policy enforcer configurations, one per each tenant, similarly to how it can be done for xref:security-openid-connect-multitenancy.adoc[Multi-Tenant OpenID Connect Service Applications].
zh_cn: 可以配置多个策略执行者的配置，每个租户一个，类似于 link:security-openid-connect-multitenancy.html[多租户OpenID连接服务应用程序] 的配置方式。

source: It is possible to read annotations from the test class or method to control what the callback shall be doing.
zh_cn: 可以从测试类或方法中读取注解，从而控制回调应做什么。

source: It is possible to write test resources that are enabled and configured using annotations. This is enabled by placing the `@QuarkusTestResource` on an annotation which will be used to enable and configure the test resource.
zh_cn: 我们也可以编写使用注解来启用和配置的测试资源。这可以通过在一个注解上使用 `@QuarkusTestResource` 来启用，该注解将被用来启用和配置测试资源。

source: It is recommended to use exactly-once processing along with the batch consumption mode. While it is possible to use it with a single Kafka message, it'll have a significant performance impact.
zh_cn: 建议在消费端批处理模式中采用exactly-once。 虽然可以将它与单个 Kafka 消息一起使用，但这样会对性能产生重大影响。

source: It is worth mentioning that this injection into the test class is not under the control of CDI and happens after CDI has performed any necessary injections into the test class.
zh_cn: 值得一提的是，这种对测试类的注入并不在CDI的控制之下，而是发生在CDI对测试类进行了所有必要的注入之后。

source: It might be tempting to add a label or tag to the counter indicating what value was checked, but remember that each unique combination of metric name (`example.prime.number`) and label value produces a unique time series. Using an unbounded set of data as label values can lead to a "cardinality explosion", an exponential increase in the creation of new time series.
zh_cn: 以上代码打算给counter添加一个标签来表明是什么值被检查了，但是请记住，metric名称( `example.prime.number` )和标签值的每个独特组合只会产生一个唯一的时间序列。使用未绑定的数据集来作为标签值会导致 "基数爆炸(cardinality explosion)"，即新的时间序列的创建会呈指数级增长。

source: It produces several outputs in `/target`:
zh_cn: 它在 `/target` ，产生几个输出：

source: It should be added to the `native-image` configuration using the `quarkus.native.additional-build-args` configuration property as shown in the examples above.
zh_cn: 它应该使用 `quarkus.native.additional-build-args` 配置属性添加到 `native-image` 配置中，如上面的例子所示。

source: It should retrieve the book content. In the output you should see the separator like:
zh_cn: 它应该获取到书籍的内容。在输出中，你应该会看到像这样包含分隔符的内容:

source: It uses Jackson underneath.
zh_cn: 它的底层使用了Jackson。

source: It's a mess because I don't know if my JPA persistence unit is using `JTA` or `Resource-level` Transaction
zh_cn: 当不知道JPA persistence unit 使用的是“JTA”还是“Resource-level”事务，这可能会造成混乱

source: It's a very simple REST endpoint, returning "Hello from RESTEasy Reactive" to requests on "/hello".
zh_cn: 这是一个非常简单的REST端点，对"/hello "上的请求返回 "Hello from RESTEasy Reactive"。

source: It's an introductory guide. The xref:vertx-reference.adoc[Vert.x reference guide] covers more advanced features such as verticles, and native transports.
zh_cn: 这是一项介绍性的指南。 link:vertx-reference.html[Vert.x参考指南] 涵盖了更多的高级功能，例如 verticles 和 本地传输 (native transports) 。

source: It's not a mess in Quarkus :) Resource-level was introduced to support JPA in a non managed environment. But Quarkus is both lean and a managed environment so we can safely always assume we are in JTA mode. The end result is that the difficulties of running Hibernate ORM + CDI + a transaction manager in Java SE mode are solved by Quarkus.
zh_cn: 在 Quarkus 中不会引起混乱 :) 引入资源级是为了在非托管环境中支持 JPA。 但是 Quarkus 既是精益环境又是托管环境，因此我们始终可以安全地假设我们处于 JTA 模式。 最终的结果是，Quarkus 解决了在 Java SE 模式下运行 Hibernate ORM + CDI + 事务管理器的困难。

source: It’s a snap to be up and running with Quarkus.
zh_cn: 和Quarkus一起工作很容易。

source: JDK 11+ installed with `JAVA_HOME` configured appropriately
zh_cn: 安装JDK 11以上版本并正确配置了 `JAVA_HOME`

source: JPA batches changes you make to your entities and sends changes (it's called flush) at the end of the transaction or before a query. This is usually a good thing as it's more efficient. But if you want to check optimistic locking failures, do object validation right away or generally want to get immediate feedback, you can force the flush operation by calling `entity.flush()` or even use `entity.persistAndFlush()` to make it a single method call. This will allow you to catch any `PersistenceException` that could occur when JPA send those changes to the database. Remember, this is less efficient so don't abuse it. And your transaction still has to be committed.
zh_cn: JPA将实体的变更进行批量处理，并在事务结束时或查询前发送批量变更（这被称为flush）。这通常更有效率。但是当你想检查乐观锁的失败，即时进行对象验证，或者想得到即时的反馈，你可以通过调用 `entity.flush()` 或 `entity.persistAndFlush()` 强制执行flush。JPA向数据库发送这些变更时可能会抛出 `PersistenceException` ，你可以捕捉这些异常。记住，这样做的效率较低，所以不要滥用它。而且你的事务仍然需要提交。

source: JSON Object and JSON Array are both supported as Quarkus HTTP endpoint requests and response bodies (using classic RESTEasy and RESTEasy Reactive). Consider these endpoints:
zh_cn: JSON Object和JSON Array都支持作为Quarkus HTTP端点的请求和响应体（使用经典的RESTEasy和RESTEasy Reactive）。考虑一下这些端点：

source: JSON Serializer/deserializer generation
zh_cn: JSON序列化器/反序列化器的生成

source: JSON Web Key (JWK)
zh_cn: JSON网络密钥（JWK）

source: JSON Web Key (JWK) Base64 URL encoded
zh_cn: JSON Web Key (JWK) Base64 URL 编码

source: JSON Web Key Set (JWKS)
zh_cn: JSON网络密钥集(JWKS)

source: JSON Web Key Set (JWKS) Base64 URL encoded
zh_cn: JSON网络密钥集（JWKS）Base64 URL编码

source: JSON is now the _lingua franca_ between microservices.
zh_cn: JSON现在是微服务之间的 _通用_ 语言。

source: JSON is now the lingua franca between microservices. In this guide, we see how you can get your REST services to consume and produce JSON payloads.
zh_cn: JSON现在是微服务之间的通用语言。在本指南中，我们看看如何让你的REST服务消费和提供JSON有效载荷。

source: JSON representation of `Quote` objects will be used in messages sent to the AMQP queues and also in the server-sent events sent to browser clients.
zh_cn: `Quote` 对象的JSON表示将被用在发送给AMQP队列的消息中，也被用在发送给浏览器客户端的服务器发送事件中。

source: JSON serialization
zh_cn: JSON序列化

source: JSON serialization libraries use Java reflection to get the properties of an object and serialize them.
zh_cn: JSON序列化库使用Java反射来获取一个对象的属性并将其序列化。

source: JWK cache refresh interval in minutes. It will be ignored unless the `mp.jwt.verify.publickey.location` points to the HTTP or HTTPS URL based JWK set and no HTTP `Cache-Control` response header with a positive `max-age` parameter value is returned from a JWK HTTPS endpoint.
zh_cn: JWK缓存刷新时间间隔，单位是分钟。它将被忽略，除非 `mp.jwt.verify.publickey.location` 指向基于HTTP或HTTPS URL的JWK设置，并且没有从JWK HTTPS端点返回具有正 `max-age` 参数值的HTTP `Cache-Control` 响应header。

source: Jan 01, 2016
zh_cn: 2016年1月1日

source: Jan 01, 2021
zh_cn: 2021年1月1日

source: Java System Properties - `aws.accessKeyId` and `aws.secretAccessKey`
zh_cn: Java 系统属性 - `aws.accessKeyId` 和 `aws.secretAccessKey`

source: Java code that relies on preview features requires special attention. To produce a native executable, this means that the `--enable-preview` flag needs to be passed to the underlying native image invocation. You can do so by prepending the flag with `-J` and passing it as additional native build argument: `-Dquarkus.native.additional-build-args=-J--enable-preview`.
zh_cn: 依赖于预览功能的Java代码需要特别注意。为了产生一个原生可执行文件，这意味着需要将 `--enable-preview` 标志传递给底层的原生镜像调用。你可以这样做，用 `-J` 作为标志的前缀，并将其作为额外的原生构建参数传递：`-Dquarkus.native.additional-build-args=-J--enable-preview`。

source: Java code that relies on preview features requires special attention. To test a native executable, this means that the `--enable-preview` flag needs to be passed to the Surefire plugin. Adding `<argLine>--enable-preview</argLine>` to its `configuration` section is one way to do so.
zh_cn: 依赖于预览功能的Java代码需要特别注意。为了测试一个原生可执行文件，这意味着需要将 `--enable-preview` 标志传递给Surefire插件。将 `<argLine>--enable-preview</argLine>` 添加到其 `configuration` 片段是一种可行方法。

source: Java preview features
zh_cn: Java预览功能

source: Join the Quarkus Community
zh_cn: 加入Quarkus社区

source: Json path of Principal Name
zh_cn: 主体名的Json路径

source: Kafka Broker Readiness Check
zh_cn: Kafka Broker就绪检查(Readiness Check)

source: Kafka Client
zh_cn: Kafka客户端

source: Kafka Configuration Resolution
zh_cn: Kafka配置方案

source: Kafka Reactive Messaging Health Checks
zh_cn: Kafka响应式消息传递健康检查

source: Kafka Streams
zh_cn: Kafka流

source: Kafka Transactions
zh_cn: Kafka事务处理

source: Kafka Transactions allows managing consumer offsets inside a transaction, together with produced messages. This enables coupling a consumer with a transactional producer in a _consume-transform-produce_ pattern, also known as *exactly-once processing*.
zh_cn: Kafka 事务可以同时管理其中的消费端和生产端的消息偏移量。 这使得消费端能够以 _consume-transform-produce_ 模式与生产端耦合，也称为 *exactly-once 精确一次性处理*。

source: Kafka transactional producers require configuring `acks=all` client property, and a unique id for `transactional.id`, which implies `enable.idempotence=true`. When Quarkus detects the use of `KafkaTransactions` for an outgoing channel it configures these properties on the channel, providing a default value of `"${quarkus.application.name}-${channelName}"` for `transactional.id` property.
zh_cn: Kafka 事务生产者需要配置 `acks=all` 客户端属性，以及 `transactional.id` 的唯一 id，这意味着 `enable.idempotence=true` 。 当 Quarkus 检测到传出通道使用 `KafkaTransactions` 时，它会在通道上配置这些属性，为 `transactional.id` 属性提供默认值 `"${quarkus.application.name}-${channelName}"` 。

source: Kafka transactions enable atomic writes to multiple Kafka topics and partitions. The Kafka connector provides `KafkaTransactions` custom emitter for writing Kafka records inside a transaction. It can be injected as a regular emitter `@Channel`:
zh_cn: Kafka 事务支持对多个 Kafka 主题和分区进行原子写入。 Kafka 连接器提供了 `KafkaTransactions` 自定义emitter，用于在事务中写入 Kafka 记录。 它可以作为常规emitter `@Channel` 注入：

source: Keep confidential your database credentials by storing them in Vault.
zh_cn: 将你的数据库凭证存储在Vault中，对其进行保密。

source: Key identifier. If it is set then the verification JWK key as well every JWT token must have a matching `kid` header.
zh_cn: 密钥标识符。如果它被设置，那么验证JWK密钥以及每个JWT标记必须有一个匹配的 `kid` header。

source: Keystore password. If `mp.jwt.verify.publickey.location` or `mp.jwt.decrypt.key.location` then this property has be set.
zh_cn: Keystore密码。如果有 `mp.jwt.verify.publickey.location` 或 `mp.jwt.decrypt.key.location` ，则此属性必须被设置。

source: Kotlin and Jackson
zh_cn: Kotlin和Jackson

source: Kotlin and the Kubernetes Client
zh_cn: Kotlin和Kubernetes客户端

source: Kotlin co-routines - a way to write asynchronous code in a sequential manner
zh_cn: Kotlin co-routines - 一种以顺序方式编写异步代码的方法

source: Kotlin coroutines and Mutiny
zh_cn: Kotlin coroutines和Mutiny

source: Kotlin data classes are a very convenient way of defining data carrier classes, making them a great match to define an entity class.
zh_cn: Kotlin data classes是定义数据载体类的一种非常方便的方式，非常适合定义实体类。

source: Kotlin reflection annotation processing differs from Java. You may experience an error when using CDI @Inject such as: "kotlin.UninitializedPropertyAccessException: lateinit property xxx has not been initialized"
zh_cn: Kotlin的反射注解处理与Java不同。在使用CDI @Inject时，您可能会遇到错误，比如。"kotlin.UninitializedPropertyAccessException: lateinit property xxx has not been initialized"

source: Kotlin requires a @field: xxx qualifier as it has no @Target on the annotation definition. Add @field: xxx in this example. @Default is used as the qualifier, explicitly specifying the use of the default bean.
zh_cn: Kotlin需要一个@field:xxx 限定符，因为它在注解定义上没有@Target。在此示例中添加@field: xxx 。@Default作为限定符，显式指定使用默认bean。

source: Kubernetes Native
zh_cn: Kubernetes原生

source: Kubernetes Service Bindings
zh_cn: Kubernetes服务绑定

source: Kubernetes, but also bare metal
zh_cn: Kubernetes，但也包括裸金属环境

source: Kubernetes-native
zh_cn: Kubernetes原生

source: LICENSE
zh_cn: 许可证

source: Label and tag can be used interchangably. You may also see "attribute" used in this context in some documentation. The gist is each that each label or tag or attribute defines an additional bit of information associated with the single numerical measurement that helps you classify, group, or aggregate the measured value later. The Micrometer API uses `Tag` as the mechanism for specifying this additional data.
zh_cn: Label和tag可以互换使用。您也可能在一些文档中看到 "属性 "在类似的上下文中使用。要点是每个标签，标记或属性都定义了与一个单一数字测量值相关的一组额外信息，以帮助您以后对测量值进行分类、分组或汇总。Micrometer API使用 `Tag` 作为指定这种额外数据的机制。

source: Last Publish Date
zh_cn: 最后发布日期

source: Lastly different applications can subscribe independently to same topics using different *consumer group ids*. For example, messages published to a topic called _orders_ can be consumed independently on two consumer applications, one with `mp.messaging.incoming.orders.group.id=invoicing` and second with `mp.messaging.incoming.orders.group.id=shipping`. Different consumer groups can thus scale independently according to the message consumption requirements.
zh_cn: 最后，不同的应用程序可以使用不同的 *consumer group ids* 来的独立订阅同一topic。例如，发布在一个名为 _orders_ 的topic上的消息可以被两个消费者应用相互独立的消费，其中一个的group id是 `mp.messaging.incoming.orders.group.id=invoicing` ，另一个是 `mp.messaging.incoming.orders.group.id=shipping` 。因此，不同的消费者组可以根据消息消费的需求独立的进行扩容。

source: Lastly, the `producer` will read the quotes and send them to the browser using server-sent events. The user will therefore see the quote price updated from _pending_ to the received price in real-time.
zh_cn: 最后， `producer` 将读取报价，并使用服务器发送事件将其发送给浏览器。因此，用户将实时看到报价从 _pending_ 更新为收到的价格。

source: Launching containers
zh_cn: 启动容器

source: Learn everything you need to know about the Qute template engine.
zh_cn: 了解你需要知道的关于Qute模板引擎的一切。

source: Learn how to build and push container images with Jib, S2I or Docker as part of the Quarkus build.
zh_cn: 了解如何使用Jib、S2I或Docker构建和推送容器镜像，作为Quarkus构建的一部分。

source: Learn how to create a Hello World Quarkus app. This guide covers:
zh_cn: 学习如何创建一个Hello World Quarkus应用程序。本指南包括：

source: Learn how to customize the Redis client to your needs.
zh_cn: 了解如何根据自己的需要定制Redis客户端。

source: Learn how to get your extension contribute features to the Dev UI.
zh_cn: 了解如何让你的扩展为Dev UI贡献功能。

source: Learn how to integrate your extension with Quarkus' CDI container.
zh_cn: 了解如何将你的扩展与Quarkus的CDI容器集成。

source: Learn how to test your Quarkus Application. This guide covers:
zh_cn: 学习如何测试您的Quarkus应用程序。本指南包括：

source: Learn how you can reduce the size of your native executables with UPX.
zh_cn: 了解你如何用UPX减少你的原生可执行文件的大小。

source: Learn more about Quarkus class loading infrastructure.
zh_cn: 了解关于Quarkus类加载基础设施的更多信息。

source: Learn more about Quarkus integrations in IDEs.
zh_cn: 了解更多关于Quarkus在IDE中的整合。

source: Learn more about Quarkus reactive architecture.
zh_cn: 了解关于Quarkus响应式架构的更多信息。

source: Learn more about configuring Quarkus' Vert.x based HTTP layer - and Undertow if you are using servlets.
zh_cn: 了解更多关于配置Quarkus基于Vert.x的HTTP层的信息--如果你使用servlets的话，还有Undertow。

source: Learn more about developing reactive applications with Quarkus.
zh_cn: 了解有关使用Quarkus开发响应式应用程序的更多信息。

source: Learn more about how Quarkus handles authentication.
zh_cn: 了解更多关于Quarkus如何处理认证的信息。

source: Learn more about how to configure your Quarkus applications.
zh_cn: 了解更多关于如何配置你的Quarkus应用程序。

source: Learn more about how to develop reactive applications with Quarkus.
zh_cn: 了解更多关于如何用Quarkus开发响应式应用程序的信息。

source: Learn more about how you can pass contextual information with SmallRye Context Propagation.
zh_cn: 了解更多关于如何利用SmallRye Context Propagation传递上下文信息的信息。

source: Learn more about how you can send email from a Quarkus application with our reactive email client.
zh_cn: 了解更多关于如何使用我们的响应式电子邮件客户端从Quarkus应用程序发送电子邮件。

source: Learn more about how you can use templating in your applications with the Qute template engine.
zh_cn: 了解更多关于如何利用Qute模板引擎在你的应用程序中使用模板。

source: Learn more about how you extract content from documents using the Apache Tika toolkit.
zh_cn: 了解更多关于如何使用Apache Tika工具包从文档中提取内容。

source: Learn more about the Scheduler extension.
zh_cn: 了解更多关于Scheduler扩展的信息。

source: Learn more about the base runtime image used by Quarkus for native executables and how you can tweak it.
zh_cn: 了解更多关于Quarkus用于原生可执行文件的基本运行时镜像，以及如何调整它。

source: Learn more about the notion of extension registry and how you can use your own.
zh_cn: 了解更多关于扩展仓库的概念，以及如何使用自己的扩展仓库。

source: Learn more about what we call a Platform in the Quarkus world.
zh_cn: 了解更多关于Quarkus 世界中我们称之为平台的东西。

source: Learn step by step how to build a simple extension.
zh_cn: 一步一步地学习如何构建一个简单的扩展。

source: Legacy API approach
zh_cn: 传统的API方法

source: Let's consider the following scenarios:
zh_cn: 让我们考虑以下场景：

source: Let's continue our API with `getSingle`:
zh_cn: 让我们用 `getSingle` 继续我们的API：
